<div style="border: 1px solid lightblue; padding: 10px; border-radius: 5px; background-color: #f9f9f9;">
    <h1 style="color: #4CAF50; font-family: Arial, sans-serif;">Pandas Tutorial</h1>
    <p>Pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.</p>
</div>

### Agenda
- What is Data Frames?
- What is Data Series?
- Different Operation in Pandas

In [3]:
## First setp is to import Pandas

import pandas as pd
import numpy as np

##### Dataframe: dataframes is combination of both columns and rows it is basically show you a representation format.

In [7]:
## Playing with Dataframes
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=['column1','column2','column3','column4'])

In [37]:
df[['column3','column4']]

      column3  column4
Row1        2        3
Row2        6        7
Row3       10       11
Row4       14       15
Row5       18       19

In [8]:
df.head()

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [11]:
df.to_csv('Test1.csv')            ## test1.csv file located in jupyter home page

In [13]:
## Accessing the elements
## 1.   .loc  2.   .iloc

type(df.loc['Row1'])

pandas.core.series.Series

In [15]:
df.loc['Row1']         ## basically converting into an array

column1    0
column2    1
column3    2
column4    3
Name: Row1, dtype: int32

#### NOTE:

#### In 'R' Programming language index starts from "1"
####           In 'Python' Programming language index starts from "0"

In [16]:
df.iloc[:,:]

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [17]:
df.iloc[0:2,0:2]

      column1  column2
Row1        0        1
Row2        4        5

In [18]:
type(df.iloc[0:2,0:2])

pandas.core.frame.DataFrame

In [22]:
df.iloc[0:2,0]

Row1    0
Row2    4
Name: column1, dtype: int32

In [24]:
# Take the element from the column2

df.iloc[:,1:]

      column2  column3  column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [27]:
# convert dataframe into an arrays

df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [28]:
df.iloc[:,1:].values.shape                ##shape of the particular array

(5, 3)

In [30]:
## how to check null values 

df.isnull().sum()

column1    0
column2    0
column3    0
column4    0
dtype: int64

In [31]:
df

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [32]:
df['column1'].unique()

array([ 0,  4,  8, 12, 16])

In [29]:
df['column1'].value_counts()

column1
0     1
4     1
8     1
12    1
16    1
Name: count, dtype: int64